Autodesk.Revit.DB.Structure.RebarHostData.GetRebarHostDirectNeighbors(Autodesk.Revit.DB.Element)
Returns a set of ElementIds for Elements joined to the provided host element.
Remarks:
This function returns the first level of neighbors for the provided host, meaning elements that are joined directly to the provided host element (not the neighbors of the joined elements also).
These elements can also host reinforcement.
hostElement:
The host element. Must be an element that can host reinforcement.
Returns:
The neighbor ids.
Throws Autodesk.Revit.Exceptions.ArgumentException:
hostElement is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025